<?php

/*
 * Copyright (c) 2018-2019 http://www.levme.com All rights reserved.
 *
 * 创建时间：2019-08-19 00:42
 *
 * 项目：Default (Template) Project  -  $  - ${FILE_NAME}
 *
 * 作者：liwei  Levme.com <675049572@qq.com>
 */

$this->blocks['optable'] = \app\modules\ucenter\modules\registers\models\UcenterRegisters::tableName();

$types = \app\modules\ucenter\modules\registers\models\UcenterRegisters::getType();

$this->title = '批量注册用户 &raquo; 添加';

$this->blocks['tips'] = '【注意】批量注册用户不能通过密码登陆，仅供系统程序调用';

?>

<form class="list" id="my-form" action="" method="post">
    <input type="hidden" name="<?=Yii::$app->request->csrfParam?>" value="<?=Yii::$app->request->csrfToken ?>">
    <ul>
        <li>
            <div class="item-content item-input">
                <div class="item-inner">
                    <div class="item-title item-label">选择分类：</div>
                    <div class="item-input-wrap">
                        <select name="dget[typeid]">
                            <?php foreach ($types as $v) : ?>
                                <option value="<?=$v['id']?>"><?=$v['name']?></option>
                            <?php endforeach; ?>
                        </select>
                    </div>
                </div>
            </div>
        </li>
        <li>
            <div class="item-content item-input">
                <div class="item-inner">
                    <div class="item-title item-label">新增分类：</div>
                    <div class="item-input-wrap">
                        <input type="text" name="dget[name]" placeholder="优先使用新增分类">
                    </div>
                </div>
            </div>
        </li>
        <li class="item-content item-input">
            <div class="item-inner">
                <div class="item-title item-label">用户名：</div>
                <div class="item-after" style="margin-top:-15px;">
                    <a class="button color-gray button-fill" onclick="randomUserName()">随机10个</a>
                </div>
                <div class="item-input-wrap">
                    <textarea style="height:320px;" name="usernames" placeholder="请输入要注册的用户名；&#10;一行一个用户名。"></textarea>
                </div>
            </div>
        </li>
        <li>
            <div class="item-content item-input">
                <div class="item-inner">
                    <div class="item-title item-label">密码：</div>
                    <div class="item-input-wrap">
                        <input type="text" name="dget[password]" placeholder="所有账号的统一密码">
                    </div>
                </div>
            </div>
        </li>
        <li>
            <div class="item-content item-input">
                <div class="item-inner">
                    <div class="item-input">
                        <input type="submit" class="button button-active" id="dosubmit" name="dosubmit" value=" 提 交 ">
                    </div>
                </div>
            </div>
        </li>
    </ul>
</form>



<script>
    const firstName = [
        '张的', '朱的', '谢得', '杨得', '周得', '孙得', '许地', '李地', '王的', '陈地', '何地', '孙地', '马得', '刘得', '杜得', '师得', '石得',
        '高得', '张得', '诸葛', '赵得', '周的','吴的', '李的','孙的',

        '颓废的','建谈的','高级的','低调的','奢华的','牛B的','有趣的','搞笑的','猪的','彩的','溜的','凶的','白的','黑的','灰色','郭的','龙的','用的','天的','地的',
        '有用的','无才的','沉默的','高的','瘦的','肥的','美的','圆的','方的',

        '天魁星','呼保义',
        '天罡星','玉麒麟',
        '天机星','智多星',
        '天闲星','入云龙',
        '天勇星','大刀',
        '天雄星','豹子头',
        '天猛星','霹雳火',
        '天威星','双鞭',
        '天英星','小李广',
        '天贵星','小旋风',
        '天富星','扑天雕',
        '天満星','美髯公',
        '天孤星','花和尚',
        '天伤星','行者',
        '天立星','双枪将',
        '天捷星','没羽箭',
        '天暗星','青面獣',
        '天佑星','金枪手',
        '天空星','急先锋',
        '天速星','神行太保',
        '天异星','赤髪鬼',
        '天杀星','黒旋风',
        '天微星','九纹龙',
        '天究星','没遮拦',
        '天退星','挿翅虎',
        '天寿星','混江龙',
        '天剣星','立地太歳',
        '天平星','船火児',
        '天罪星','短命二郎',
        '天损星','浪里白跳',
        '天败星','活阎罗',
        '天牢星','病关索',
        '天慧星','拚命三郎',
        '天暴星','两头蛇',
        '天哭星','双尾蝎',
        '天巧星','浪子',
        '地魁星','神机军师',
        '地煞星','镇三山',
        '地勇星','病尉遅',
        '地杰星','丑郡马',
        '地雄星','井木犴',
        '地威星','百胜将',
        '地英星','天目将',
        '地奇星','圣水将',
        '地猛星','神火将',
        '地文星','圣手书生',
        '地正星','鉄面孔目',
        '地辟星','摩云金翅',
        '地阖星','火眼狻猊',
        '地强星','锦毛虎',
        '地暗星','锦豹子',
        '地辅星','轰天雷',
        '地会星','神算子',
        '地佐星','小温侯',
        '地佑星','赛仁贵',
        '地霊星','神医',
        '地獣星','紫髯伯',
        '地微星','矮脚虎',
        '地慧星','一丈青',
        '地暴星','丧门神',
        '地黙星','混世魔王',
        '地猖星','毛头星',
        '地狂星','独火星',
        '地飞星','八臂哪吒',
        '地走星','飞天大圣',
        '地巧星','玉臂匠',
        '地明星','鉄笛仙',
        '地进星','出洞蛟',
        '地退星','翻江蜃',
        '地満星','玉幡竿',
        '地遂星','通臂猿',
        '地周星','跳涧虎',
        '地隠星','白花蛇',
        '地异星','白面郎君',
        '地理星','九尾亀',
        '地俊星','鉄扇子',
        '地楽星','鉄叫子',
        '地捷星','花项虎',
        '地速星','中箭虎',
        '地镇星','小遮拦',
        '地羁星','操刀鬼',
        '地魔星','云里金刚',
        '地妖星','摸着天',
        '地幽星','病大虫',
        '地僻星','打虎将',
        '地空星','小霸王',
        '地孤星','金銭豹子',
        '地全星','鬼睑児',
        '地短星','出林龙',
        '地角星','独角龙',
        '地囚星','旱地忽律',
        '地蔵星','笑面虎',
        '地伏星','金眼彪',
        '地平星','鉄臂膊',
        '地损星','一枝花',
        '地奴星','催命判官',
        '地察星','青眼虎',
        '地悪星','没面目',
        '地丑星','石将军',
        '地数星','小尉遅',
        '地阴星','母大虫',
        '地刑星','菜园子',
        '地壮星','母夜叉',
        '地劣星','活闪婆',
        '地健星','険道神',
        '地耗星','白日鼠',
        '地贼星','鼓上蚤',
        '地狗星','金毛犬',

        '洛阳的','建业的','成都的','汉中的','南皮的','北平的','武威的','天水的','庐江的','会稽的','江陵的','长沙的','零陵的','桂阳的','建宁的','云南的','西平的',
        '长安的','宛城的','许昌的','小沛的','下邳的','武陵的','江洲的','陈留的','平原的','新野的','襄阳的','濮阳的',

        '司州的','豫州的','兖州的','徐州的','青州的','凉州的','并州的','冀州的','幽州的','扬州的','荆州的','益州的','交州的',

        '天津的','黑龙江的', '吉林的', '辽宁的', '河北的', '河南的', '山东的', '山西的', '陕西的', '内蒙古的', '宁夏的', '甘肃的', '新疆的', '青海的', '西藏的',
        '湖北的', '安徽的', '江苏的', '上海的', '浙江的', '福建的', '湖南的', '江西的', '四川的', '贵州的', '云南的', '广东的', '广西的', '海南的', '香港的', '澳门的',
        '北京的','重庆的','沈阳的','台湾的'
    ];
    const secondName = ['园', '样', '综', '辉', '叶', '传人', '子', '金', '茹', '成', '枭', '笑', '彤', '林', '龙', '名', '胜', '钰', '和', '明', '霓',
        '杰', '云', '支', '茶','迪','淼','焱','森',
        '过', '修', '禾', '朗', '聪', '格', '新', '元', '树', '曼', '丁', '恩', '丽', '一', '水', '流', '文', '年', '桑', '晁', '则', '昊', '天', '若',
        '飞', '函', '轩', '兆', '琼', '莫', '让', '燕', '阳', '熊', '军', '浅', '杰', '项', '蓉', '静', '康', '建', '瑞', '笨', '博', '坡', '坚', '艺',

        '女神','帅哥','大神','高楼','天空','智商','政王','将军','丞相','美女','网红','蓝天','白云','黑土','星失',

        '白羊座','金牛座','双子座','巨蟹座','狮子座','处女座','天秤座','天蝎座','射手座','摩羯座','水瓶座','双鱼座',

        '荀彧','荀攸','贾诩','郭嘉','程昱','戏志才','刘晔','蒋济','陈群','华歆','钟繇','满宠','董昭','王朗','崔琰','毛玠','杜畿','田畴','王修','杨修','辛毗','杨阜',
        '田豫','王粲','蒯越','张继','杜袭','枣祗','任峻','陈矫','郗虑','桓玠','丁仪','丁廙','司马朗','韩暨','韦康','邴原','赵俨','娄圭','贾逵','陈琳','司马懿',
        '张辽','徐晃','夏侯惇','夏侯渊','庞德','张郃','李典','乐进','典韦','曹洪','曹仁','曹彰','曹纯','于禁','许褚','吕虔','李通','文聘','臧霸','郭淮','钟会',
        '邓艾','曹休','张燕','张绣','朱灵','路昭','史涣','韩浩','王凌','孙礼','秦朗','郑文','夏侯尚','毌丘俭','诸葛诞','孙乾','简雍','糜竺','糜芳','庞统','法正',
        '许靖','马良','徐庶','陈震','杨仪','费祎','蒋琬','孟优','黄皓','诸葛亮','关羽','张飞','马超','黄忠','赵云','魏延','关平','周仓','关兴','张苞','陈到',
        '李严','姜维','廖化','马谡','马岱','陈式','雷铜','吴兰','王平','任夔','张翼','马忠','张南','冯习','傅佥','关索','陆逊','张昭','张紘','鲁肃','虞翻',
        '顾雍','诸葛谨','诸葛恪','陆凯','骆统','周鲂','周瑜','吕蒙','甘宁','太史慈','程普','黄盖','韩当','周泰','蒋钦','丁奉','徐盛','陈武','凌操','凌统',
        '潘璋','朱然','孙桓','马忠','孙韶','朱桓','夏恂','周平','全琮','于诠','张角','何进','董卓','袁绍','吕布','袁术','刘表','刘璋','马腾','张鲁','韩遂',
        '公孙瓒','韩馥','刘岱','王匡','张邈','孔伷','陶谦','鲍信','桥瑁','袁遗','孔融','张超','张杨','刘度','赵范','金旋','韩玄','张宝','张梁','程远志','邓茂',
        '马元义','赵弘','韩忠','孙夏','管亥','何仪','刘辟','龚都','裴元绍','高升','张闿','韩暹','李乐','杨奉','董承','王子服','李儒','陈宫','田丰','沮授','审配',
        '许攸','郭图','逢纪','辛评','荀谌','辛毗','陈登','蒯良','王累','韩胤','沮鹄','杨弘','阎象','蒯越','伍孚','李傕','郭汜','颜良','文丑','潘凤','俞涉','武安国',
        '穆顺','华雄','牛辅','张济','樊稠','胡轸','胡车儿','李肃','高顺','张任','高览','曹性','闵纯','纪灵','马休','马铁','高览','袁谭','袁熙','袁尚','高干','麴义',
        '吕翔','吕旷','韩猛','淳于琼','焦触','张南','马延','雷薄','张勋','陈纪','桥蕤','郝萌','侯成','宋宪','魏续','成廉','蔡瑁','张允','黄祖','苏飞','吕公','侯选',
        '程银','李堪','张横','梁兴','成宜','马玩','杨秋',

        '宋江','卢俊义','吴用','公孙胜','关胜','林冲','秦明','呼延灼','花荣','柴进','李应','朱仝','鲁智深','武松','董平','张清','杨志','徐宁','索超','戴宗','刘唐',
        '李逵','史进','穆弘','雷横','李俊','阮小二','张横','阮小五','张顺','阮小七','杨雄','石秀','解珍','解宝','燕青','朱武','黄信','孙立','宣赞','郝思文','韩滔',
        '彭玘','单廷','魏定国','萧让','裴宣','欧鹏','邓飞','燕顺','子杨林','凌振','蒋敬','吕方','郭盛','安道全','皇甫端','王英','扈三娘','鲍旭','樊瑞','孔明','孔亮',
        '项充','李衮','金大坚','马麟','童威','童猛','孟康','侯健','陈达','杨春','郑天寿','陶宗旺','宋清','乐和','龚旺','丁得孙','穆春','曹正','宋万','杜迁','薛永',
        '施恩','李忠','汤隆','杜兴','邹渊','邹润','朱贵','朱富','蔡福','蔡庆','李立','李云','焦挺','石勇','孙新','顾大嫂','张青','孙二娘','王定六','郁保四','白胜',
        '时迁','段景住','周通',

        //'古董白','米色','桔黄色','黑色','白杏色','蓝色','紫罗兰色','褐色','实木色','军兰色','黄绿色','巧可力色','珊瑚色','菊','兰色',
        //'米绸色','暗深红色','青色','暗蓝色','暗青色','暗金黄','暗灰色','暗绿色','暗黄褐色','暗洋红','暗橄榄绿','暗桔黄','暗紫','暗红',
        //'暗肉色','暗海兰','暗灰蓝','墨绿色','宝石绿','紫罗兰','深粉红','深蓝色','暗灰','闪兰','火砖','花白','森林绿'
    ];


    function getRandomByArr(arr) {
        const length = arr.length;
        return arr[Math.floor(Math.random() * length)];
    }

    function getName() {
        var first  = getRandomByArr(firstName);
        var second = getRandomByArr(secondName);
        return first + second;
    }

    function randomUserName(){
        for (var i=0; i<10; i++) {
            jQuery('[name=usernames]').val(jQuery('[name=usernames]').val() +"\n" + getName());
        }
    }
</script>






